/*
*********************************************************************************************************
*
*	模块名称 : 延时函数
*	文件名称 : delay.c
*	版    本 : V1.0
*	说    明 : 延时ms及延时us
*	修改记录 :
*		版本号  日期       	作者    说明
*		V1.0	2013-12-6	JOY
*
*********************************************************************************************************
*/

#include "delay.h"

__IO uint32_t TimingDelay;

/*
*********************************************************************************************************
*	函 数 名: delay_ms
*	功能说明: 延时ms
*	形    参：nms-延迟长度
*	返 回 值: 无
*********************************************************************************************************
*/     
void delay_ms(volatile uint32_t nms)
{
	// SYSTICK分频--1ms系统时钟中断
	if(SysTick_Config(SystemCoreClock / 1000))	// 返回1-失败，0-配置成功
		while(1);
	
	TimingDelay = nms;
	while(TimingDelay);
	
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0x00;       //清空计数器	
}

/*
*********************************************************************************************************
*	函 数 名: delay_us
*	功能说明: 延时us
*	形    参：nus-延迟长度
*	返 回 值: 无
*********************************************************************************************************
*/     
void delay_us(volatile uint32_t nus)
{
	// SYSTICK分频--1us系统时钟中断
	if(SysTick_Config(SystemCoreClock / 1000000))	// 返回1-失败，0-配置成功
		while(1);
	
	TimingDelay = nus;
	while(TimingDelay);
	
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
	SysTick->VAL =0x00;       //清空计数器	
}

/*
*********************************************************************************************************
*	函 数 名: SysTick_ISR
*	功能说明: SysTick中断服务程序
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void SysTick_ISR(void)
{
	if (TimingDelay)
	{ 
		TimingDelay--;
	}
}

